In [2]:
import pandas as pd

dataset = "https://raw.githubusercontent.com/jakevdp/PythonDataScienceHandbook/master/notebooks/data/births.csv"

df = pd.read_csv(dataset)
df.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [14]:
df.dtypes

year        int64
month       int64
day       float64
gender     object
births      int64
dtype: object

In [15]:
df.isnull().sum()

year        0
month       0
day       480
gender      0
births      0
dtype: int64

In [27]:
df.gender.dtype

dtype('O')

In [ ]:
# filtering rows by types using select dtypes
alt_df = df.select_dtypes(include=["object", "float64"])
alt_df

       day gender
0      1.0      F
1      1.0      M
2      2.0      F
3      2.0      M
4      3.0      F
...    ...    ...
15542  NaN      M
15543  NaN      F
15544  NaN      M
15545  NaN      F
15546  NaN      M

[15547 rows x 2 columns]

In [ ]:
# dropping empty vals

alt_df.dropna()

        day gender
0       1.0      F
1       1.0      M
2       2.0      F
3       2.0      M
4       3.0      F
...     ...    ...
15062  29.0      M
15063  30.0      F
15064  30.0      M
15065  31.0      F
15066  31.0      M

[15067 rows x 2 columns]